//AUTO JOB (001),'RUNAUTO',NOTIFY=&SYSUID
//ASM      EXEC ASMACL,MBR=AUTOMATA
//C.SYSIN  DD DSN=&SYSUID..SOURCE(AUTOMATA),DISP=SHR
//GO       EXEC PGM=AUTOMATA
//STEPLIB  DD DSN=&SYSUID..LOAD,DISP=SHR
//INFILE   DD *
HELLO WORLD!
/*                                         
//SYSPRINT DD SYSOUT=*

